<template>
  <div>
    <v-card>
      <v-card class="vision">
        <v-card-title>辛くても継続できることを見極める</v-card-title>
        <v-card-text>
          <p>
            このアプリは、他人から期待されていることを認識した上で、自分が熱望することに集中するために開発しました。
          </p>
          <div>
            僕は熱望することに集中している限り、辛くても継続できると確信しています。
          </div>
          <div>
            理由は、辛くても続けられるものが自分の熱望しているものだからです。
          </div>
          <p>
            例えばアプリ開発はすごく大変で一時間に1回は挫折しますが、あなたが開いているこのページも挫折を繰り返して実現したアプリの1ページです。
          </p>
          <p>
            このアプリはその熱望しているものを見つけ忘れないために開発しました。
          </p>
          <div>■■■以下駄文■■■</div>
          <p>
            学生時代、やりたいことは社会でさまざまな経験を重ねていくうちに自然と見つかると思っていました。
          </p>
          <div>
            <p>
              しかし社会に出て目の当たりにしたのは、ただ日々の業務に邁進するだけの先輩たちでした。
            </p>
            <div>
              将来やりたいこともなく日々を消化しているだけの姿を目の当たりにして、
            </div>
            <p>
              自分もこのような人間になってしまうという恐怖と、SNSから流れてくる同年代の成功に対する焦りが生まれました。
            </p>
            <div>このままではまずい</div>
            <p>
              そう感じてからは、少しでも良い方向に向かえるようにさまざまなことを試しました。
            </p>
            <div>・ 他人より多くの残業</div>
            <div>・ 休日返上しての資格の取得</div>
            <p>・ 一日一冊の読書週間 etc.</p>
            <div>
              結果どれも効果がないと感じ現状で継続できているものはありません。
            </div>
            <p>
              継続できない自分、上向かない人生に絶望し、自分自身を口と気持ちだけの滑稽な人間だと卑下していました。
            </p>
            <div>
              状況が変わったのは、自分がやりたいことは何かを考えるようになってからです。
            </div>
            <p>
              どうせ、何をやってもダメなら自分のやりたいことを真剣に考えてやってみようと思ったのです。
            </p>
            <div>
              自分がやりたいことを書き出してみると、やりたいことではないけど有益だと思っていることが多くありました。
            </div>
            <p>
              この有益なものは諦めて、自分のやりたいことを見つけ出しました。
            </p>
            <div>
              自分のやりたいことをやっていると、毎日辛いことにぶつかりますが自然と継続できるようになりました。
            </div>
            <div>
              状況が大きく変わったわけではありませんが、毎日が充実しており方向性は間違っていないと確信しています。
            </div>
            <p>
              あとは、やりたいことを忘れないように常に思い出すようにしています。
            </p>
          </div>
        </v-card-text>
      </v-card>
      <v-card class="usage">
        <v-card-title>USAGE</v-card-title>
        <v-card-text>
          <p>①まずログインしてください</p>
          <div>
            ②次にサイドバー"goals"をクリックしてgoal設定をおこないます。
          </div>
          <p>
            ここでは自分の目標を書き出して、その目標が他人から期待されているかどうかで分類してください(ドラッグ＆ドロップ)
          </p>
          <p>
            ③goalの分類が終わったら"DONE"ボタンをクリックしてmypageへ遷移してください
          </p>
          <p>
            ④最後にmypageでgoalを達成したい理由、そのための毎日のタスクを登録してください
          </p>
          <v-btn color="primary" @click="login">Start Amaimon</v-btn>
        </v-card-text>
      </v-card>
    </v-card>
  </div>
</template>
<script>
export default {
  methods: {
    login() {
      window.location.href = '/users/login'
    },
  },
}
</script>
